app/application/url_shortener/repositories/all_urls.rb

      def find(long_url:)
        begin
          valid?(long_url: long_url)
          url_model = Url.find_by_url!(long_url)
---
SELECT "urls".* FROM "urls" WHERE "urls"."url" = $1 LIMIT $2  [["url", "https://www.youtube.com"], ["LIMIT", 1]]

      def create(long_url:, base_url:)
        url_model = Url.new(url: long_url)
        url_model.save!
---
INSERT INTO "urls" ("url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "https://www.google.com"], ["short_url", nil], ["created_at", "2022-12-28 03:20:38.998691"], ["updated_at", "2022-12-28 03:20:38.998691"]]