app/controllers/api/v1/urls_controller.rb

SELECT "urls".* FROM "urls" WHERE "urls"."url" = $1 LIMIT $2  [["url", "https://www.youtube.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "urls" WHERE "urls"."url" = $1 LIMIT $2  [["url", "https://www.youtube.com"], ["LIMIT", 1]]
---
      def create
        begin
          validate_url()
          if Url.exists?(url: params[:url])